app/controllers/reservations_controller.rb

INSERT INTO "reservations" ("name", "place", "room", "organization", "datetime", "finish_time", "members", "division", "status", "token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    params = reservation_params
    rooms = params[:rooms] - ['0']
    base_reservation = Reservation.new(params.except(:rooms, :date, :start_time))
    base_reservation.datetime = "#{params[:date]} #{params[:start_time]}"
    base_reservation.token = User.new(session[:user]).encrypted
    if (base_reservation.datetime.to_date - Date.today).to_i > CrawlerHelper::MAX_FORWARD[params[:place]]
      base_reservation.status = 'Reserva Futura'
    else
      base_reservation.status = 'Processando Reserva'
    end
    reservations = []
    rooms.each do |room|
      reservation = base_reservation.dup
      reservation.room = CrawlerHelper::CCSUL_ROOMS.invert[room]
      reservation.save